# Chapter 7

In [4]:
import pandas as pd
import numpy as np

In [5]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [6]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
from numpy import nan as NA

In [9]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [10]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                   [NA, NA, NA], [NA, 6.5, 3.]])

In [13]:
cleaned = data.dropna()

In [14]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [16]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [17]:
data[4] = NA

In [18]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [19]:
data.dropna(axis=1, how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [20]:
df = pd.DataFrame(np.random.randn(7, 3))

In [21]:
df.iloc[:4, 1] = NA

In [22]:
df.iloc[:2,2] = NA

In [23]:
df

          0         1         2
0 -0.507889       NaN       NaN
1  0.219972       NaN       NaN
2 -0.642404       NaN -2.732503
3  0.355794       NaN  1.289591
4  0.325501  0.851090 -1.455013
5  2.553710  1.516695  0.052663
6  0.693808  1.336470  0.984449

In [24]:
df.dropna()

          0         1         2
4  0.325501  0.851090 -1.455013
5  2.553710  1.516695  0.052663
6  0.693808  1.336470  0.984449

In [25]:
df.dropna(thresh=2)

          0         1         2
2 -0.642404       NaN -2.732503
3  0.355794       NaN  1.289591
4  0.325501  0.851090 -1.455013
5  2.553710  1.516695  0.052663
6  0.693808  1.336470  0.984449

In [26]:
df.fillna(0)

          0         1         2
0 -0.507889  0.000000  0.000000
1  0.219972  0.000000  0.000000
2 -0.642404  0.000000 -2.732503
3  0.355794  0.000000  1.289591
4  0.325501  0.851090 -1.455013
5  2.553710  1.516695  0.052663
6  0.693808  1.336470  0.984449

In [27]:
df.fillna({1:0.5, 2: 0})

          0         1         2
0 -0.507889  0.500000  0.000000
1  0.219972  0.500000  0.000000
2 -0.642404  0.500000 -2.732503
3  0.355794  0.500000  1.289591
4  0.325501  0.851090 -1.455013
5  2.553710  1.516695  0.052663
6  0.693808  1.336470  0.984449

In [28]:
df.fillna(0, inplace=True)

In [29]:
df

          0         1         2
0 -0.507889  0.000000  0.000000
1  0.219972  0.000000  0.000000
2 -0.642404  0.000000 -2.732503
3  0.355794  0.000000  1.289591
4  0.325501  0.851090 -1.455013
5  2.553710  1.516695  0.052663
6  0.693808  1.336470  0.984449

In [31]:
df = pd.DataFrame(np.random.randn(6,3))

In [38]:
df.iloc[2:, 1] = NA

In [39]:
df.iloc[4:, 2] = NA

In [40]:
df

          0         1         2
0  0.827900  0.968600 -0.261543
1 -1.345215  0.742596  2.254011
2  0.793274       NaN -0.568976
3  0.649154       NaN  0.958140
4  1.425643       NaN       NaN
5 -0.737703       NaN       NaN

In [41]:
df.fillna(method = 'ffill')

          0         1         2
0  0.827900  0.968600 -0.261543
1 -1.345215  0.742596  2.254011
2  0.793274  0.742596 -0.568976
3  0.649154  0.742596  0.958140
4  1.425643  0.742596  0.958140
5 -0.737703  0.742596  0.958140

In [42]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.827900  0.968600 -0.261543
1 -1.345215  0.742596  2.254011
2  0.793274  0.742596 -0.568976
3  0.649154  0.742596  0.958140
4  1.425643       NaN  0.958140
5 -0.737703       NaN  0.958140

In [43]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [44]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [45]:
data = pd.DataFrame({'k1': ['one', 'two']*3 + ['two'], 
                     'k2': [1,1,2,3,3,4,4]})

In [46]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [47]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [48]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [49]:
data['v1'] = range(7)

In [50]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [51]:
data.drop_duplicates(['k1','k2'], keep = 'last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [52]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 
                              'Pastrami', 'corned beef', 'Bacon',
                             'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4,3,12,6,7.5,8,3,5,6]})

In [53]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [54]:
meat_to_animal = {'bacon': 'pig', 'pulled pork': 'pig', 'pastrami': 'cow', 'corned beef': 'cow', 'honey ham': 'pig', 'nova lox': 'salmon'}

In [55]:
lowercased = data['food'].str.lower()

In [56]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [58]:
data['animal'] = lowercased.map(meat_to_animal)

In [59]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [60]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [61]:
data = pd.Series([1., -999., 2., -999, -1000., 3.])

In [62]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [63]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [64]:
data.replace([-999, -1000],[np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [65]:
data.replace({-999:np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [68]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                    index=['Ohio', 'Colorado', 'New York'],
                          columns=['one', 'two', 'three', 'four'])

In [70]:
transform = lambda x: x[:4].upper()

In [71]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [72]:
data.rename(index=str.title, columns = str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [73]:
data.rename(index = {'Ohio':'INDIANA'},
           columns = {'three': 'peekaboo'})

          one  two  peekaboo  four
INDIANA     0    1         2     3
Colorado    4    5         6     7
New York    8    9        10    11

In [74]:
data.rename(index={'Ohio': 'INDIANA'}, inplace=True)

In [75]:
data

          one  two  three  four
INDIANA     0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [76]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [77]:
bins = [18, 25, 35, 60, 100]

In [78]:
cats = pd.cut(ages, bins)

In [79]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [80]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [81]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [83]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [84]:
pd.cut(ages, [18, 26, 36, 61, 100], right = False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [85]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [86]:
pd.cut(ages, bins, labels = group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [87]:
data = np.random.rand(20)

In [88]:
pd.cut(data, 4, precision=2)

[(0.12, 0.34], (0.12, 0.34], (0.77, 0.98], (0.55, 0.77], (0.34, 0.55], ..., (0.34, 0.55], (0.77, 0.98], (0.12, 0.34], (0.55, 0.77], (0.12, 0.34]]
Length: 20
Categories (4, interval[float64, right]): [(0.12, 0.34] < (0.34, 0.55] < (0.55, 0.77] < (0.77, 0.98]]

In [89]:
data = np.random.randn(1000)

In [90]:
cats = pd.qcut(data, 4)

In [91]:
cats

[(0.715, 3.369], (-0.642, 0.0578], (-0.642, 0.0578], (0.715, 3.369], (-3.354, -0.642], ..., (0.715, 3.369], (-0.642, 0.0578], (0.715, 3.369], (0.0578, 0.715], (0.0578, 0.715]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.354, -0.642] < (-0.642, 0.0578] < (0.0578, 0.715] < (0.715, 3.369]]

In [92]:
pd.value_counts(cats)

(-3.354, -0.642]    250
(-0.642, 0.0578]    250
(0.0578, 0.715]     250
(0.715, 3.369]      250
dtype: int64

In [93]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(0.0578, 1.24], (-1.24, 0.0578], (-1.24, 0.0578], (1.24, 3.369], (-1.24, 0.0578], ..., (1.24, 3.369], (-1.24, 0.0578], (1.24, 3.369], (0.0578, 1.24], (0.0578, 1.24]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.354, -1.24] < (-1.24, 0.0578] < (0.0578, 1.24] < (1.24, 3.369]]

In [94]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [95]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.036418    -0.004776    -0.001360     0.013709
std       0.977944     1.017611     1.008164     1.005414
min      -3.117290    -3.530057    -2.965376    -3.138625
25%      -0.710008    -0.690119    -0.704973    -0.614991
50%      -0.026264    -0.030113     0.019601     0.022195
75%       0.619336     0.681765     0.675668     0.672363
max       2.979509     3.044477     3.377975     2.807187

In [96]:
col = data[2]

In [97]:
col[np.abs(col) > 3]

220    3.295959
715    3.317142
875    3.377975
Name: 2, dtype: float64

In [102]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
97   1.598862 -3.530057 -1.020183  1.601441
132  1.539419  0.238359  0.390561 -3.138625
220  0.834867 -1.106440  3.295959  1.321636
334 -3.117290 -2.279301 -1.375314 -1.037458
468  0.634236 -3.284872 -1.800935  0.175449
500 -1.208603  3.044477 -0.384853 -1.457584
623 -0.817062 -3.043232  1.141868 -0.157887
715  0.504054  0.087245  3.317142  0.674631
875  0.987537  1.464461  3.377975 -0.147214

In [103]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [104]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.036301    -0.003963    -0.002351     0.013847
std       0.977582     1.014767     1.005040     1.004988
min      -3.000000    -3.000000    -2.965376    -3.000000
25%      -0.710008    -0.690119    -0.704973    -0.614991
50%      -0.026264    -0.030113     0.019601     0.022195
75%       0.619336     0.681765     0.675668     0.672363
max       2.979509     3.000000     3.000000     2.807187

In [105]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0  1.0  1.0
1  1.0 -1.0 -1.0 -1.0
2 -1.0 -1.0 -1.0  1.0
3 -1.0  1.0  1.0 -1.0
4  1.0  1.0  1.0  1.0

In [106]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [107]:
sampler = np.random.permutation(5)

In [108]:
sampler

array([1, 2, 0, 4, 3])

In [109]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [110]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
2   8   9  10  11
0   0   1   2   3
4  16  17  18  19
3  12  13  14  15

In [111]:
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
0   0   1   2   3
4  16  17  18  19

In [112]:
choices = pd.Series([5, 7, -1, 6, 4])

In [113]:
draws = choices.sample(n=10, replace = True)

In [114]:
draws

1    7
2   -1
1    7
1    7
3    6
4    4
3    6
4    4
1    7
1    7
dtype: int64

In [115]:
df = pd.DataFrame({'key':['b', 'b', 'a', 'c', 'a', 'b'],
                  'data1': range(6)})

In [116]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [117]:
dummies = pd.get_dummies(df['key'], prefix = 'key')

In [119]:
df_with_dummy = df[['data1']].join(dummies)

In [120]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [121]:
mnames =['movie_id','title','genres']

In [123]:
movies = pd.read_table('datasets/movielens/movies.dat', sep= '::', header=None, names=mnames)

/var/folders/v9/rxbybbsd6_5ggf0ds1w6gcy40000gp/T/ipykernel_5057/3644418659.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies = pd.read_table('datasets/movielens/movies.dat', sep= '::', header=None, names=mnames)

FileNotFoundError: [Errno 2] No such file or directory: 'datasets/movielens/movies.dat'

In [125]:
#movies[:10]

In [126]:
#all_genres = []

In [129]:
#for x in movies.genres:
#    all_genres.extend(x.split('|'))

In [131]:
#genres = pd.unique(all_genres)

In [132]:
#genres

In [134]:
#zero_matrix = np.zeros((len(movies), len(genres)))

In [135]:
#dummies = pd.DataFrame(zero_matrix, columns=genres)

In [136]:
#gen = movies.genres[0]

In [137]:
#gen.split('|')

In [139]:
#dummies.columns.get_indexer(gen.split('|'))

In [140]:
#for i, gen in enumerate(movies.genres):
#    indices = dummies.columns.get_indexer(gen.split('|'))
#    dummies.iloc[i, indices] = 1

In [141]:
#movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [142]:
#movies_windic.iloc[0]

In [144]:
np.random.seed(12345)

In [145]:
values = np.random.rand(10)

In [146]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [147]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [148]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [151]:
val = 'a,b, guido'

In [152]:
val.split(',')

['a', 'b', ' guido']

In [153]:
pieces = [x.strip() for x in val.split(',')]

In [154]:
pieces

['a', 'b', 'guido']

In [155]:
first, second, third = pieces

In [156]:
first + '::' + second + '::' + third

'a::b::guido'

In [157]:
'::'.join(pieces)

'a::b::guido'

In [158]:
'guido' in val

True

In [159]:
val.index(',')

1

In [160]:
val.find(':')

-1

In [161]:
val.index(':')

ValueError: substring not found

In [162]:
val.count(',')

2

In [164]:
val.replace(',', '::')

'a::b:: guido'

In [165]:
val.replace(',', '')

'ab guido'

In [166]:
import re

In [167]:
text = "foo bar\t baz \tqux"

In [168]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [169]:
regex = re.compile('\s+')

In [170]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [171]:
regex.findall(text)

[' ', '\t ', ' \t']

In [172]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [173]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [174]:
m = regex.search(text)

In [175]:
m

In [176]:
text[m.start():m.end()]

'dave@google.com'

In [177]:
print(regex.match(text))

None

In [178]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [179]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [180]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [181]:
m = regex.match('wesm@bright.net')

In [182]:
m.groups()

('wesm', 'bright', 'net')

In [184]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [187]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [213]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
       'Rob':'rob@gmail.com', 'Wes': np.nan}

In [214]:
data = pd.Series(data)

In [215]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [216]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [217]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [218]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [219]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [220]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [221]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [224]:
#matches.str.get(1)

In [225]:
#matches.str[0]

In [226]:
#data.str[:5]